election.dat <- data.frame(type=c("대통령","대통령","대통령","대통령",
                                  "국회의원","국회의원","국회의원","국회의원",
                                  "지방선거","지방선거","지방선거","지방선거"),
                  subtype=c("15대", "16대", "17대", "18대",
                            "17대", "18대", "19대", "20대",
                            "3회","4회","5회","6회"),
                  start=as.POSIXct(c("1997-12-18","2002-12-19","2007-12-19","2012-12-19",
                                     "2004-5-30","2008-5-30", "2012-5-30","2016-5-30",
                                     "2002-7-1", "2006-7-1", "2010-7-1","2014-7-1")),
                    end=as.POSIXct(c("2002-12-18","2007-12-18","2012-12-19","2017-12-19",
                                     "2008-5-29", "2012-5-29","2016-5-29","2020-5-29",
                                     "2006-6-30", "2010-6-30", "2014-6-30","2018-6-30")))

plot(
  gvisTimeline(data=election.dat, 
               rowlabel="type", barlabel="subtype", 
               start="start", end="end")
)

